import React from "react";

const page = () => {
  return (
    <div className="container text-[16px] mx-auto p-6">
      <h1 className="text-3xl font-bold mb-4">Пользовательское соглашение</h1>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">1. Общие положения</h2>
        <p>
          Настоящее Пользовательское соглашение (далее — «Соглашение»)
          регулирует условия использования Сайта [название вашего сайта], а
          также порядок предоставления услуг Самозанятой Чепуриной Дарьей
          Анатольевной, ИНН 425300104691 (далее — «Компания»). Продолжая
          использовать Сайт, Пользователь подтверждает, что ознакомился и
          согласен с условиями Соглашения.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">
          2. Оформление заказа и предоставление услуг
        </h2>
        <p>
          Пользователь оформляет заказ на Сайте, используя специальный
          конструктор, где указывает:
        </p>
        <ul className="list-disc list-inside">
          <li>данные для создания карты (дата и местоположение);</li>
          <li>параметры для печати (размер карты в сантиметрах).</li>
        </ul>
        <p>
          После обработки заказа готовый файл отправляется на адрес электронной
          почты, указанный Пользователем. Пользователь обязуется предоставить
          корректные данные и проверять их перед оформлением заказа и оплатой.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">3. Порядок оплаты</h2>
        <p>
          Оплата производится через сервис ЮКасса, предоставляемый ООО НКО
          «ЮМани» с лицензией Банка России № 3510-К. Платежная система ЮКасса
          обеспечивает безопасность и конфиденциальность платежных данных
          Пользователя. Компания не обрабатывает и не хранит данные банковских
          карт и не несет ответственности за работу платформы ЮКасса.
        </p>
        <p>
          После подтверждения платежа услуга считается оказанной, и возврат
          средств невозможен, так как продукт доставляется Пользователю в полном
          объеме.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">
          4. Ограничение ответственности
        </h2>
        <p>Компания не несет ответственности за:</p>
        <ul className="list-disc list-inside">
          <li>
            ошибки в данных, предоставленных Пользователем для создания карты;
          </li>
          <li>потерю доступа к электронной почте Пользователя;</li>
          <li>
            несоответствие карты личным ожиданиям Пользователя, так как все
            параметры карты выбираются Пользователем самостоятельно.
          </li>
        </ul>
        <p>
          Пользователь принимает, что конечный продукт предназначен
          исключительно для личного использования и не может быть передан
          третьим лицам для коммерческой перепродажи или иных целей.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">5. Авторские права</h2>
        <p>
          Электронные карты, предоставленные Компанией, являются
          интеллектуальной собственностью Компании и защищены законом.
          Пользователь получает право на печать карты для личного использования,
          но не на перепродажу или воспроизведение в коммерческих целях.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">
          6. Изменение и расторжение Соглашения
        </h2>
        <p>
          Компания вправе вносить изменения в настоящее Соглашение, уведомляя об
          этом пользователей через публикацию новой версии на Сайте.
          Пользователь обязуется регулярно проверять актуальность Соглашения
          перед оформлением новых заказов.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">7. Связь и поддержка</h2>
        <p>
          Для связи с представителем Компании по вопросам использования услуг и
          содержанию Соглашения Пользователь может направить запрос на адрес
          help@cosmomap.ru. Все обращения рассматриваются в рабочие дни в
          течение 48 часов.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">
          8. Применимое право и разрешение споров
        </h2>
        <p>
          Все споры, возникающие в рамках настоящего Соглашения, подлежат
          разрешению в соответствии с законодательством Российской Федерации. В
          случае возникновения претензий, Пользователь обязуется связаться с
          Компанией через указанный контактный адрес для поиска мирного
          урегулирования.
        </p>
      </section>

      <h1 className="text-3xl font-bold mb-4">Политика конфиденциальности</h1>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">1. Общие положения</h2>
        <p>
          Настоящая Политика конфиденциальности (далее — «Политика») регулирует
          порядок сбора, использования и хранения персональных данных,
          предоставляемых пользователями сайта [название вашего сайта] (далее —
          «Сайт»). Настоящая Политика обязательна для исполнения ИП Чепурина
          Дарья Анатольевна, ОГРН 425300104691 (далее — «Компания»).
        </p>
        <p>
          Пользователь, посещая Сайт и осуществляя действия по оформлению
          заказа, соглашается с условиями Политики и дает свое согласие на
          обработку персональных данных в соответствии с законодательством
          Российской Федерации.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">
          2. Персональные данные и цели их обработки
        </h2>
        <p>
          Компания обрабатывает минимально необходимый объем данных, включающий:
          адрес электронной почты, указанный Пользователем для получения
          готового продукта (электронной карты звездного неба). Данные
          используются исключительно для выполнения заказа и предоставления
          информации по обслуживанию заказа.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">
          3. Передача данных третьим лицам
        </h2>
        <p>
          Компания не передает данные Пользователя третьим лицам, за исключением
          случаев, предусмотренных законодательством Российской Федерации, а
          также случаев, когда передача данных необходима для выполнения заказа
          (например, передача данных платежной системе).
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">4. Платежные данные</h2>
        <p>
          Оплата заказов на Сайте осуществляется через сервис ЮКасса,
          предоставляемый ООО НКО «ЮМани», лицензия Банка России № 3510-К. При
          оплате данные обрабатываются на стороне платежной системы ЮКасса, что
          гарантирует высокую степень защиты данных Пользователя. Компания не
          получает и не хранит платежные данные, включая данные банковских карт.
          Для подробной информации о политике конфиденциальности ЮКасса
          Пользователь может обратиться на официальный сайт сервиса yookassa.ru.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">
          5. Защита и хранение данных
        </h2>
        <p>
          Компания принимает все необходимые меры, включая административные и
          технические, для защиты персональных данных Пользователя от
          несанкционированного доступа, утраты, изменения, разглашения или
          уничтожения.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">6. Связь с компанией</h2>
        <p>
          Пользователь имеет право связаться с Компанией для разъяснения
          вопросов, связанных с обработкой персональных данных, по адресу
          электронной почты: help@cosmomap.ru.
        </p>
      </section>

      <section className="mb-6">
        <h2 className="text-2xl font-semibold mb-2">
          7. Внесение изменений в Политику
        </h2>
        <p>
          Компания оставляет за собой право вносить изменения в настоящую
          Политику. Актуальная редакция всегда доступна на Сайте, и продолжение
          использования Сайта после изменений означает согласие Пользователя с
          обновленными условиями.
        </p>
      </section>
    </div>
  );
};

export default page;
